# RbsElecRoomLightingCalcLuminaireplane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecRoomLightingCalcLuminaireplane Property
ParameterTypeId Class See Also
---
"Lighting Calculation Luminaire Plane"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecRoomLightingCalcLuminaireplane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecRoomLightingCalcLuminaireplane As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecRoomLightingCalcLuminaireplane {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace